### `Criando tabelas e inserindo dados no SQLite3`
https://docs.python.org/3/library/sqlite3.html

In [40]:
# Importando o SQLite3
import sqlite3

In [41]:
# Criando uma conexão
con = sqlite3.connect("tutorial.db")

In [42]:
# Criando um cursor
cur = con.cursor()

In [43]:
# Criando uma tabela da documentação

cur.execute("CREATE TABLE movie(title, year, score)")

In [44]:
# inserindo linhas conforme documentação

cur.execute("""
    INSERT INTO movie VALUES
        ('Monty Python and the Holy Grail', 1975, 8.2),
        ('And Now for Something Completely Different', 1971, 7.5)
""")

In [45]:
# Selecionando todos os dados da tabela criada
cur.execute('SELECT * FROM movie').fetchall()

[('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5)]

In [46]:
# Salvando as mudanças
con.commit()

In [47]:
# deletando a tabela movie para limpar espaço
cur.execute('DROP TABLE movie')

In [48]:
# Fechando a conexão
con.close()

### `Adicionando um DataFrame como tabela na base`
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html

In [49]:
# Importando o pandas
import pandas as pd

In [50]:
dados = {
    'x': [1, 2, 3, 4, 5],
    'y': [10, 9, 8, 7, 6],
    'z': ['a', 'b', 'c', 'd', 'e']
}

dados = pd.DataFrame(dados)

In [51]:
# visualizando o dataframe
dados.head()

   x   y  z
0  1  10  a
1  2   9  b
2  3   8  c
3  4   7  d
4  5   6  e

In [52]:
# abrindo a conexão novamente
import sqlite3
con = sqlite3.connect('exemplo.db')

In [53]:
# adicionando essa base em uma tabela
dados.to_sql('dados',con,if_exists='replace')

5

`if_exists` {'fail', 'replace', 'append'}, padrão 'fail'
Como se comportar se a tabela já existir.

- fail: gera um ValueError.

- replace: Elimine a tabela antes de inserir novos valores.

- append: Insere novos valores na tabela existente.

In [54]:
# criando o cursor
cur = con.cursor()

In [55]:
# selecionando todos os dados da tabela
cur.execute('SELECT * FROM dados').fetchall()

[(0, 1, 10, 'a'),
 (1, 2, 9, 'b'),
 (2, 3, 8, 'c'),
 (3, 4, 7, 'd'),
 (4, 5, 6, 'e')]

In [56]:
# visualizando o nome das colunas
cur.description

(('index', None, None, None, None, None, None),
 ('x', None, None, None, None, None, None),
 ('y', None, None, None, None, None, None),
 ('z', None, None, None, None, None, None))

In [57]:
# adicionado a tabela sem o index
dados.to_sql('dados',con,if_exists='replace',index=False)

5

In [58]:
# visualizando novamente o nome das colunas
cur.description

(('index', None, None, None, None, None, None),
 ('x', None, None, None, None, None, None),
 ('y', None, None, None, None, None, None),
 ('z', None, None, None, None, None, None))

## `DROP TABLE`

- permite apagar qualquer tabela do banco de dados
- cuidado comando é `IRREVERSIVEL`

In [59]:
# executando o DROP da tabela

cur.execute('DROP TABLE dados')

In [60]:
# verificando se a tabela foi apagada
# cur.execute('SELECT * FROM dados').fetchall()

# A tabela foi apagada

- `Recomeçando a tabela sem o index`

In [61]:
dados.to_sql('dados',con,if_exists='replace',index=False)
cur.execute('SELECT * FROM dados').fetchall()

[(1, 10, 'a'), (2, 9, 'b'), (3, 8, 'c'), (4, 7, 'd'), (5, 6, 'e')]

## `Inserindo novos valores `

In [62]:
dados2 = {
    'x': [6, 7, 8],
    'y': [5, 4, 3],
    'z': ['f', 'l', 'h']
}

dados2 = pd.DataFrame(dados2)
dados2.head()

   x  y  z
0  6  5  f
1  7  4  l
2  8  3  h

In [63]:
# usando o append na base

dados2.to_sql('dados',con,index=False,if_exists='append')

3

In [64]:
# fazendo o select
cur.execute('SELECT * FROM dados').fetchall()

[(1, 10, 'a'),
 (2, 9, 'b'),
 (3, 8, 'c'),
 (4, 7, 'd'),
 (5, 6, 'e'),
 (6, 5, 'f'),
 (7, 4, 'l'),
 (8, 3, 'h')]

- utlizando o `INSERT` para adicionar valores

In [65]:
# adicionando os valores (9,2,'j')

cur.execute('INSERT INTO dados values (9,2,"j")')

In [66]:
# fazendo o SELECT

cur.execute('SELECT * FROM dados').fetchall()

[(1, 10, 'a'),
 (2, 9, 'b'),
 (3, 8, 'c'),
 (4, 7, 'd'),
 (5, 6, 'e'),
 (6, 5, 'f'),
 (7, 4, 'l'),
 (8, 3, 'h'),
 (9, 2, 'j')]

In [67]:
# Utilizando placeholder para adicionar valores (10, 1, 'j')
cur.execute('INSERT INTO dados values (?,?,?)', (10, 1, 'j'))

In [68]:
# fazendo o SELECT

cur.execute('SELECT * FROM dados').fetchall()

[(1, 10, 'a'),
 (2, 9, 'b'),
 (3, 8, 'c'),
 (4, 7, 'd'),
 (5, 6, 'e'),
 (6, 5, 'f'),
 (7, 4, 'l'),
 (8, 3, 'h'),
 (9, 2, 'j'),
 (10, 1, 'j')]

### `Ou utilizar o .executemany() para adicionar valores a lista`

In [69]:
adicionar = [
    (11, 0, 'k'),
    (12, -1, 'l'),
    (13, -2, 'm')
]

In [70]:
# adicionando esses valores
cur.executemany('INSERT INTO dados values (?,?,?)', adicionar)

In [71]:
# fazendo o SELECT

cur.execute('SELECT * FROM dados').fetchall()

[(1, 10, 'a'),
 (2, 9, 'b'),
 (3, 8, 'c'),
 (4, 7, 'd'),
 (5, 6, 'e'),
 (6, 5, 'f'),
 (7, 4, 'l'),
 (8, 3, 'h'),
 (9, 2, 'j'),
 (10, 1, 'j'),
 (11, 0, 'k'),
 (12, -1, 'l'),
 (13, -2, 'm')]

In [72]:
con.commit()
con.close()

`UPDATE e DELETE`

In [73]:
import sqlite3
con = sqlite3.connect ('exemplo.db')

In [74]:
cur = con.cursor()

In [75]:
# visualizando a tabela
cur.execute('SELECT * FROM dados').fetchall()

[(1, 10, 'a'),
 (2, 9, 'b'),
 (3, 8, 'c'),
 (4, 7, 'd'),
 (5, 6, 'e'),
 (6, 5, 'f'),
 (7, 4, 'l'),
 (8, 3, 'h'),
 (9, 2, 'j'),
 (10, 1, 'j'),
 (11, 0, 'k'),
 (12, -1, 'l'),
 (13, -2, 'm')]

In [76]:
# Atualizando a linha 7 para a letra g ao invés da letra l
#cur.execute('UPDATE dados SET z = "g"')

# esse UPDATE substitui todos as letras da tabela por g, causando a perda de informações da tabela

In [78]:
# Filtrando somente a linha que precisa ser atualizada
cur.execute('SELECT * FROM dados WHERE x=7').fetchall()

[(7, 4, 'l')]

In [79]:

cur.execute('UPDATE dados SET z="g" WHERE x=7')

In [80]:
# visualizando a tabela
cur.execute('SELECT * FROM dados').fetchall()

[(1, 10, 'a'),
 (2, 9, 'b'),
 (3, 8, 'c'),
 (4, 7, 'd'),
 (5, 6, 'e'),
 (6, 5, 'f'),
 (7, 4, 'g'),
 (8, 3, 'h'),
 (9, 2, 'j'),
 (10, 1, 'j'),
 (11, 0, 'k'),
 (12, -1, 'l'),
 (13, -2, 'm')]

In [83]:
# deletando as ultimas 2 linhas
cur.execute('DELETE FROM dados WHERE x=12 or x=13')

In [84]:
# visualizando a tabela
cur.execute('SELECT * FROM dados').fetchall()

[(1, 10, 'a'),
 (2, 9, 'b'),
 (3, 8, 'c'),
 (4, 7, 'd'),
 (5, 6, 'e'),
 (6, 5, 'f'),
 (7, 4, 'g'),
 (8, 3, 'h'),
 (9, 2, 'j'),
 (10, 1, 'j'),
 (11, 0, 'k')]